{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL exercises\n",
    "\n",
    "Below two exercises that let you explore querying with SPARQL. \n",
    "\n",
    "In SPARQL, you have four query types: \n",
    "1. SELECT: Return matches as a collection of solution bindings.\n",
    "2. CONSTRUCT: Create RDF triples from matches.\n",
    "3. DESCRIBE: Create RDF triples about a resource.\n",
    "4. ASK: Check if at least one match exists."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL exercises\n",
    "\n",
    "Below two exercises that let you explore querying with SPARQL. \n",
    "\n",
    "In SPARQL, you have four query types: \n",
    "1. SELECT: Return matches as a collection of solution bindings.\n",
    "2. CONSTRUCT: Create RDF triples from matches.\n",
    "3. DESCRIBE: Create RDF triples about a resource.\n",
    "4. ASK: Check if at least one match exists."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Exercise 1**\n",
    "\n",
    "1. Load the recipe.rdf and ingredient.rdf into GraphDB and start the SPARQL service (or you will not be able to query it)\n",
    "    - tip: load both in a separate named graph, one named graph for ingredients, and one for recipes.  \n",
    "2. Perform the following queries:\n",
    "    - SELECT all recipes and their descriptions, ordered alphabetically\n",
    "    - SELECT all recipes meant for dinner\n",
    "    - SELECT the recipes that contain the most number of ingredients  \n",
    "    - ASK if there is any recipe that has a glycemic index of exactly 5. \n",
    "    - SELECT recipes that have less than 30 minutes cooking time\n",
    "    \n",
    "**Construct queries:** Since a CONSTRUCT query (example below) constructs a graph, and therefor outputs triples instead of a table, you can use it to generate a modified version of the graph, but also to visualise a subgraph. In GraphDB, after running a CONSTRUCT query in the GraphDB SPARQL service, you can select 'Visual' in the lower right corner. \n",
    "\n",
    "   - try to visualise an interesting part of the graph: for example a single gluten-free recipe and its ingredients \n",
    "In the WHERE part of the query, all subjects ?s and objects ?o will be retrieved that are connected with the property wtm:hasIngredient. The CONSTRUCT part will take ?s and ?o and create a new graph, by again connecting ?s and ?o with wtm:hasIngredient. If you want to create a graph with a _new_ property, you can also do this by replacing the property in the CONSTRUCT part with another one. \n",
    "\n",
    "\n",
    "CONSTRUCT { ?s wtm:hasIngredient ?o } \n",
    "WHERE { ?s wtm:hasIngredient ?o }\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "from ast import arg\n",
    "from rdflib import Graph, RDFS, RDF, URIRef, Namespace, Literal, XSD\n",
    "from owlrl import DeductiveClosure, RDFS_Semantics\n",
    "import random, sys\n",
    "import sys\n",
    "import os\n",
    "import pandas as pd\n",
    "from string import Template\n",
    "import re\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "def Query1(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "select ?label where { \n",
    "\t?s rdf:type wtm:Ingredient .\n",
    "    ?s rdfs:label ?label \n",
    "    } order by asc(?label)\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "def Query2(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "select * where { \n",
    "    ?s wtm:isRecommendedForMeal wtm:Dinner, wtm:Lunch\n",
    "} \n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "def Query3(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "select ?s  (count(?o) AS ?count)\n",
    "where { \n",
    "    ?s wtm:hasIngredient ?o .\n",
    "} group by (?s)\n",
    "having (?count > 9)\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "\n",
    "def Query4(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "ASK {\n",
    "    SELECT ?s (SUM(xsd:double(?g)) as ?sum)  WHERE { \n",
    "        ?s wtm:hasIngredient ?i . \n",
    "        ?i  wtm:hasGlycemicIndex ?g .  \n",
    "\t} group by ?s\n",
    "\thaving (?sum > xsd:double(\"300\")) \n",
    "}\n",
    "\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#', 'xsd': 'http://www.w3.org/2001/XMLSchema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "\n",
    "def Query5(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "select * where { \n",
    "\t?s wtm:hasCookTime ?o .\n",
    "    FILTER(?o < 30)\n",
    "}\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "\n",
    "def Query6(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "CONSTRUCT \n",
    "\t{ ?r wtm:hasIngredient ?i } \n",
    "WHERE {\n",
    "    \n",
    "    ?r wtm:hasIngredient ?i . \n",
    "    \n",
    "    {\n",
    "        SELECT ?r {\n",
    "        ?r wtm:hasIngredient ?i . \n",
    "        MINUS { ?r wtm:hasIngredient/wtm:hasGluten True }   \n",
    "        } LIMIT 1\n",
    "    } \n",
    "} \n",
    "\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(rdflib.term.URIRef('http://purl.org/heals/ingredient/ChickenSalad'),\n",
       "  rdflib.term.Literal('15', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer'))),\n",
       " (rdflib.term.URIRef('http://purl.org/heals/ingredient/ThaiChicken'),\n",
       "  rdflib.term.Literal('15', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer'))),\n",
       " (rdflib.term.URIRef('http://purl.org/heals/ingredient/WholeGrainBananaPancake'),\n",
       "  rdflib.term.Literal('20', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')))]"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = Graph()\n",
    "g.parse(\"../data/ingredients.rdf\")\n",
    "g.parse(\"../data/recipes.rdf\")\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "Query5(g)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Exercise 2**\n",
    "1. Explore the [LMDB](https://triplydb.com/Triply/linkedmdb) dataset\n",
    "2. Perform the following queries:\n",
    "    - How many classes are there? \n",
    "    - Which are the distinguishing properties of a <https://triplydb.com/Triply/linkedmdb/vocab/Film> class? \n",
    "    - Can you find the 5 actors that performed in most movies, and the name of these movies ? \n",
    "    - What is the IRI of “Tom Hanks (Actor)” ?\n",
    "    - Can you find the IRI of movies and with their DBpedia correspondent IRI?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(rdflib.term.URIRef('http://www.openlinksw.com/schemas/graphql/intro#__Type'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.openlinksw.com/schemas/graphql/intro#fields')),\n",
       " (rdflib.term.URIRef('urn:records:test#'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('urn:records:test#')),\n",
       " (rdflib.term.URIRef('https://sklep.sizeer.com/air-jordan-1-mid-meskie-sneakersy-bialy-554724-092'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://sklep.sizeer.com/nowosci/kategoria-akcesoria')),\n",
       " (rdflib.term.URIRef('https://sklep.sizeer.com/air-jordan-1-mid-meskie-sneakersy-bialy-554724-092'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://sklep.sizeer.com/nowosci/kategoria-buty')),\n",
       " (rdflib.term.URIRef('https://sklep.sizeer.com/air-jordan-1-mid-meskie-sneakersy-bialy-554724-092'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://sklep.sizeer.com/nowosci/kategoria-odziez')),\n",
       " (rdflib.term.URIRef('http://www.wikidata.org/prop/direct/P1647'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subPropertyOf')),\n",
       " (rdflib.term.URIRef('http://www.wikidata.org/prop/direct/P2235'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subPropertyOf')),\n",
       " (rdflib.term.URIRef('http://swlab.ddns.net:8080/void.ttl#id-1f3ab19d-8e7f-426c-b897-9de7a0b072c0'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://rdfs.org/ns/void#property')),\n",
       " (rdflib.term.URIRef('http://swlab.ddns.net:8080/void.ttl#id-6f174ed9-8646-4943-b14f-d72a2d651806'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://rdfs.org/ns/void#property')),\n",
       " (rdflib.term.URIRef('https://sparql.uniprot.org/.well-known/void#void!property'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://rdfs.org/ns/void#property')),\n",
       " (rdflib.term.URIRef('https://kingsley.idehen.net/public_home/jordan/Public/record-test.ttl#'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://kingsley.idehen.net/public_home/jordan/Public/record-test.ttl#')),\n",
       " (rdflib.term.URIRef('urn:recordjiiis:test#hi'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('urn:recordjiiis:test#ji')),\n",
       " (rdflib.term.URIRef('https://cloudflare-ipfs.com/ipfs/QmadV4bC6H1RvJ2mXS3CRwJF4MNKgcrD4nFpCveiZd6jBu#V'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://cloudflare-ipfs.com/ipfs/QmadV4bC6H1RvJ2mXS3CRwJF4MNKgcrD4nFpCveiZd6jBu#_')),\n",
       " (rdflib.term.URIRef('https://cloudflare-ipfs.com/ipfs/QmadV4bC6H1RvJ2mXS3CRwJF4MNKgcrD4nFpCveiZd6jBu#V'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('https://cloudflare-ipfs.com/ipfs/QmadV4bC6H1RvJ2mXS3CRwJF4MNKgcrD4nFpCveiZd6jBu#q')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/workInfoHomepage'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/thumbnail'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/spec/'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Project'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/rdf-editor/data/foaf.ttl'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/schoolHomepage'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/OnlineGamingAccount'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/age'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/dnaChecksum'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/msnChatID'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('https://osde.demo.openlinksw.com/data/foaf.ttl'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Agent'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/isPrimaryTopicOf'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/primaryTopic'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/weblog'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://ods-qa.openlinksw.com/rdf-editor/data/foaf.ttl'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/workplaceHomepage'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/name'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/nick'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/logo'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/accountName'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Person'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/depiction'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/focus'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/img'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Image'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/givenName'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/account'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/publications'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/accountServiceHomepage'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/page'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Document'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://xmlns.com/foaf/0.1/%20-%2013/'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/topic')),\n",
       " (rdflib.term.URIRef('http://schema.org/url'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://schema.org/url')),\n",
       " (rdflib.term.BNode('nodeID://b36043'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36047'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36051'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36055'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36059'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36061'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36065'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36069'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36071'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36076'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36084'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.BNode('nodeID://b36088'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/ns/ui#property')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/about/id/entity/http/gmpg.org/xfn/11'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://gmpg.org/xfn/11#copyright')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/3061434113bdb7690b193d4145f1b2e2f9bbf533'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/47b2d8ba78d15399c4e5769da05fdaf0301fd801'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/0acc5884ea80aefaaeb4f5f25ce2f3e904ec01ce'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/daa6b0815832a679967a9c26c0e8ebac413b4a9c'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/f50fdb0f81996ac1bb62c32eb65bbbddf604fcf2'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/7b0e0cbc75a4c495ebafc7342f1f789b1e957c74'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/e88f38c73123d677d2e2b2fa129a4d969d4682f0'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/457da93bc9021d9107b78ca7b194e2ee705f4aca'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/fa562247275a2dd79fa4524baeba85a1c5b0aaeb'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/01119655ecdc0eb4705af4dbc077be9c81a445af'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/10db4249d12deb84d679786eeeca392a1ccd2b19'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/79f03f3629bd53dd3913fb83d877c8e831522ef0'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/87573a8960c0c6e00a7e8062285a194f1cb1a53f'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/896b3a7550bb43313f7e2ec3b87650ebcbcef645'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/98b6170c37dcb10a265484e19cf876d47fc7e407'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/a197a9955232a67519cb63d749e33892dfee3492'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/fe4ca02cf11fcb0c18ed9a510595c1ba4d4abe'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/787d5c10d75a81b6626062d33d9be113924c813b'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/d9525ac7f2712aa6c4f682c9acbd0b20551021db'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/27c40a690464bfa5cf37b6f3f1a624daf4bdcdd3'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/28872b3f31b8348908f0c37e266fd5025dce8f71'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/396dff08956c911442184942e92c6bf1b31207b8'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/461c88bdd655f9818ff1ac064d6ea94db7678f64'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/65c0b460d296ca9e8d7f868bbc186aa6b5dd560f'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/ac2ac319243e9822159c8bf2d924f8a8c012cf10'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/fe1a1bffb2641b922f24987f3c4519ca45234eb3'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/2a2ef271963502aa31106fdbf512e9d302bb306d'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('https://linkeddata.uriburner.com/proxy-iri/e0688c985121bafccfa3b5b8d36da29e1cb7b176'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/233a03d71ec2afbeb6e323f6cbf188fbf4545539'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/439a81e2f4008465cc45fb0bc4b87f184e6b309b'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/70ca2fe1be68ef208ab45890a0b571c0b4a114a3'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/9c03f872ce2450f92a6efcc25ae8ab48c727b77f'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/0177fe9e7f3d43fc54a89fd3622caace1e93ef4d'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/0186babf15a4b88d745915fac0de0cde8443a462'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/05fe8fd146cbaa1a3fd16fbe577d34a5448b37c7'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate')),\n",
       " (rdflib.term.URIRef('http://linkeddata.uriburner.com/proxy-iri/0ed3b41500b95978f64b266f96a23ac544b588d1'),\n",
       "  None,\n",
       "  rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate'))]"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def Query(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "SELECT\n",
    "  DISTINCT ?s ?p ?o\n",
    "WHERE\n",
    "  { \n",
    "    SERVICE <http://linkeddata.uriburner.com/sparql> \n",
    "      {\n",
    "        SELECT ?s ?p ?o\n",
    "        WHERE {?s ?o ?o}\n",
    "        LIMIT 100                \n",
    "      }\n",
    "  }\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "d = Graph()\n",
    "d.parse('http://linkeddata.uriburner.com/sparql')  \n",
    "\n",
    "Query(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def Query(graph):\n",
    "    res = graph.query(\"\"\"\n",
    "SELECT\n",
    "  DISTINCT ?s ?p ?o\n",
    "WHERE\n",
    "  { \n",
    "    SERVICE <https://api.triplydb.com/datasets/Triply/linkedmdb/services/linkedmdb/sparql> \n",
    "      {\n",
    "        SELECT *\n",
    "        WHERE {?s ?o ?o}\n",
    "        LIMIT 10               \n",
    "      }\n",
    "  }\n",
    "    \"\"\", initNs={'wtm': 'http://purl.org/heals/food/', 'rdf': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#', 'rdfs': 'http://www.w3.org/2000/01/rdf-schema#'})\n",
    "\n",
    "    return list(res)\n",
    "\n",
    "\n",
    "d = Graph()\n",
    "d.parse('https://triplydb.com/Triply/linkedmdb/vocab/Film')  \n",
    "\n",
    "Query(d)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9 (main, Dec 15 2022, 18:18:30) [Clang 14.0.0 (clang-1400.0.29.202)]"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
